# 1. Introduction to Pandas. Part I

We will use the following convention for pandas:

In [1]:
import pandas as pd

Whenever you see pd. in code, it's referring to pandas.

Pandas two main data structures are: **DataFrames** and **Series**.

- **Series**: A one-dimensional array-like object containing a sequence of values of a single type and associated labels, called an index.

- **DataFrame**: Rectangular table of data, with an ordered colletin of columns that can be different types. It has row and column labels.

Table of Contents:

- [Loading a DataFrame](#1-Loading-a-DataFrame)
- [Selecting a pandas Series from a DataFrame](#2.-Selecting-a-pandas-Series-from-a-DataFrame)
- [Renaming columns in a pandas DataFrame](#3.-Renaming-columns-in-a-pandas-DataFrame)
- [Removing columns from a pandas DataFrame](#4.-Removing-columns-from-a-pandas-DataFrame)
- [Selecting multiple rows and columns from a pandas DataFrame](#5-Selecting-multiple-rows-and-columns-from-a-pandas-DataFrame)
- [Practice exercises](#6-Practice-exercises)

## 1. Loading a DataFrame from a CSV (comma-separate value) file

Documentation for [read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)

The *ufo.csv* dataset contains reports of UFO sightings from 1930-2000.

In [30]:
# read a dataset of UFO reports into a DataFrame
url = 'https://raw.githubusercontent.com/um-perez-alvaro/Data-Science-Practice/master/Data/ufo.csv'
ufo = pd.read_csv(url)

In [31]:
type(ufo)

pandas.core.frame.DataFrame

In [32]:
# examine the first 5 rows
ufo.head() # equivalent to ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [33]:
# examine the first 10 rows
ufo.head(10) # default value is 5

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

In [34]:
# examine the last 10 rows
ufo.tail(10)

                 City Colors Reported Shape Reported State              Time
18231     Pismo Beach             NaN           OVAL    CA  12/31/2000 20:00
18232            Lodi             NaN            NaN    WI  12/31/2000 20:30
18233       Anchorage             RED        VARIOUS    AK  12/31/2000 21:00
18234        Capitola             NaN       TRIANGLE    CA  12/31/2000 22:00
18235  Fountain Hills             NaN            NaN    AZ  12/31/2000 23:00
18236      Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237     Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238     Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239     Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240            Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [35]:
# get number of rows
len(ufo)

18241

In [36]:
# get size of the dataframe: rows x columns
ufo.shape

(18241, 5)

In [37]:
# get column names
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [39]:
# data type of each column
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

Pandas data types:

Basic Type | Available Pandas types | Comments
--- | ---  | ---
Boolean | bool | Elements are 1 byte in size
Integer | int8, int16, int32, int64, int | 
Unsigned integer | uint8, uint16, uint32, uint64 
Float | float32, float64, float, longfloat | a floating point number (a float) is the computer representation of a decimal number
Strings | str, unicode
Object | object | Represents items in arrays as Python objects (an object is typycally a string)

## 2. Selecting a pandas Series from a DataFrame

A column in a DataFrame can be retrieved as a Series by dict-like notation or by attribute:

In [40]:
# select the 'City' Series using bracket notation
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [41]:
# or equivalently, use dot notation
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [42]:
type(ufo.City)

pandas.core.series.Series

In [43]:
# elements in a Series can be selected by index (using bracket notation)
city_series = ufo.City
city_series.head(10)

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
5             Valley City
6             Crater Lake
7                    Alma
8                 Eklutna
9                 Hubbard
Name: City, dtype: object

In [44]:
city_series[8]

'Eklutna'

**Bracket notation** will always work, whereas **dot notation** has limitations:

- Dot notation doesn't work if there are spaces in the Series name
- Dot notation doesn't work if the Series has the same name as a DataFrame method or attribute (like 'head' or 'shape')
- Dot notation can't be used to define the name of a new Series (see below)

In [20]:
ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [23]:
ufo.Colors Reported

SyntaxError: invalid syntax (<ipython-input-23-823f97112488>, line 1)

In [45]:
# create a new 'Location' Series (must use bracket notation to define the Series name)
ufo['Location'] = ufo.City + ', ' + ufo.State 
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [46]:
# set the DataFrame index using existing columns
ufo.set_index('Time',inplace=True)
ufo.head()

,City,Colors Reported,Shape Reported,State,Location
Time,,,,,
6/1/1930 22:00,Ithaca,NaN,TRIANGLE,NY,"Ithaca, NY"
6/30/1930 20:00,Willingboro,NaN,OTHER,NJ,"Willingboro, NJ"
2/15/1931 14:00,Holyoke,NaN,OVAL,CO,"Holyoke, CO"
6/1/1931 13:00,Abilene,NaN,DISK,KS,"Abilene, KS"
4/18/1933 19:00,New York Worlds Fair,NaN,LIGHT,NY,"New York Worlds Fair, NY"

In [50]:
ufo.City['6/1/1930 22:00']

'Ithaca'

## 3. Renaming columns in a pandas DataFrame

Documentation for [rename](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html)

In [52]:
# examine the column names
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Location'], dtype='object')

In [53]:
# rename two of the columns by using the 'rename' method
new_column_names = {'Colors Reported':'Colors_Reported', 'Shape Reported':'Shape_Reported'}
ufo.rename(columns=new_column_names, inplace=True)
ufo.head()

,City,Colors_Reported,Shape_Reported,State,Location
Time,,,,,
6/1/1930 22:00,Ithaca,NaN,TRIANGLE,NY,"Ithaca, NY"
6/30/1930 20:00,Willingboro,NaN,OTHER,NJ,"Willingboro, NJ"
2/15/1931 14:00,Holyoke,NaN,OVAL,CO,"Holyoke, CO"
6/1/1931 13:00,Abilene,NaN,DISK,KS,"Abilene, KS"
4/18/1933 19:00,New York Worlds Fair,NaN,LIGHT,NY,"New York Worlds Fair, NY"

In [54]:
# replace ALL of the column names by overwriting the 'columns' attribute
ufo_cols = ['city', 'colors_reported', 'shape_reported', 'state', 'location'] #list with the new column names
ufo.columns = ufo_cols
ufo.head()

,city,colors_reported,shape_reported,state,location
Time,,,,,
6/1/1930 22:00,Ithaca,NaN,TRIANGLE,NY,"Ithaca, NY"
6/30/1930 20:00,Willingboro,NaN,OTHER,NJ,"Willingboro, NJ"
2/15/1931 14:00,Holyoke,NaN,OVAL,CO,"Holyoke, CO"
6/1/1931 13:00,Abilene,NaN,DISK,KS,"Abilene, KS"
4/18/1933 19:00,New York Worlds Fair,NaN,LIGHT,NY,"New York Worlds Fair, NY"

In [55]:
# replace the column names during the file reading process by using the 'names' parameter
ufo = pd.read_csv(url, header=0, names=['city','colors_reported','shape_reported','state','time'])
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## 4. Removing columns and/or rows from a pandas DataFrame

Documentation for [drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

In [56]:
# remove a single column (axis=1 refers to columns)
ufo.drop('colors_reported', axis=1, inplace=True) 
ufo.head()

                   city shape_reported state             time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [22]:
# remove multiple columns at once
ufo.drop(['city', 'state'], axis=1, inplace=True)
ufo.head()

  shape_reported             time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [41]:
# remove multiple rows at once (axis=0 refers to rows)
ufo.drop([0, 1], axis=0, inplace=True)
ufo.head()

  shape_reported             time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00

## 5 Selecting multiple rows and columns from a pandas DataFrame

With **loc** and **iloc** you can do practically any data selection operation on DataFrames you can think of. loc is label-based, which means that you have to specify rows and columns based on their row and column labels. iloc is integer index based, so you have to specify rows and columns by their integer index.

- [The loc method](#1.5.1-The-loc-method)
- [The iloc method](#1.5.2-The-iloc-method)

In [57]:
# reload the ufo dataframe
ufo = pd.read_csv(url)
ufo.head(10)

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

In [25]:
# first three rows
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

### 5.1 The loc method

The loc method is for filtering rows and selecting columns by label (by their names)

In [58]:
ufo.loc[0,:] # row 0, all columns

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [60]:
ufo.loc[[0,1,2,3],:] # rows 0, 1, 2 and 3, all columns

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [59]:
# a better way:
ufo.loc[0:3,:] #rows 0 through 3, all columns

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [61]:
ufo.loc[:,'City'] # all rows, column 'city'

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [62]:
ufo.loc[:,['City','State']] # all rows, columns 'City' and 'State'

                       City State
0                    Ithaca    NY
1               Willingboro    NJ
2                   Holyoke    CO
3                   Abilene    KS
4      New York Worlds Fair    NY
...                     ...   ...
18236            Grant Park    IL
18237           Spirit Lake    IA
18238           Eagle River    WI
18239           Eagle River    WI
18240                  Ybor    FL

[18241 rows x 2 columns]

In [50]:
ufo.loc[:,'City':'State'] # all rows, columns 'City' through 'State'

                       City Colors Reported Shape Reported State
0                    Ithaca             NaN       TRIANGLE    NY
1               Willingboro             NaN          OTHER    NJ
2                   Holyoke             NaN           OVAL    CO
3                   Abilene             NaN           DISK    KS
4      New York Worlds Fair             NaN          LIGHT    NY
...                     ...             ...            ...   ...
18236            Grant Park             NaN       TRIANGLE    IL
18237           Spirit Lake             NaN           DISK    IA
18238           Eagle River             NaN            NaN    WI
18239           Eagle River             RED          LIGHT    WI
18240                  Ybor             NaN           OVAL    FL

[18241 rows x 4 columns]

In [63]:
ufo.loc[0:5,'City':'State'] # rows 0 through 5, columns City through State

                   City Colors Reported Shape Reported State
0                Ithaca             NaN       TRIANGLE    NY
1           Willingboro             NaN          OTHER    NJ
2               Holyoke             NaN           OVAL    CO
3               Abilene             NaN           DISK    KS
4  New York Worlds Fair             NaN          LIGHT    NY
5           Valley City             NaN           DISK    ND

### 5.2 The iloc method

The iloc is for filtering rows and selecting columns by integer position

In [64]:
ufo.iloc[:,[0,3]] # all rows, columns 0 and 3

                       City State
0                    Ithaca    NY
1               Willingboro    NJ
2                   Holyoke    CO
3                   Abilene    KS
4      New York Worlds Fair    NY
...                     ...   ...
18236            Grant Park    IL
18237           Spirit Lake    IA
18238           Eagle River    WI
18239           Eagle River    WI
18240                  Ybor    FL

[18241 rows x 2 columns]

In [65]:
ufo.iloc[:,0:4] # all rows, columns 0 through 3

                       City Colors Reported Shape Reported State
0                    Ithaca             NaN       TRIANGLE    NY
1               Willingboro             NaN          OTHER    NJ
2                   Holyoke             NaN           OVAL    CO
3                   Abilene             NaN           DISK    KS
4      New York Worlds Fair             NaN          LIGHT    NY
...                     ...             ...            ...   ...
18236            Grant Park             NaN       TRIANGLE    IL
18237           Spirit Lake             NaN           DISK    IA
18238           Eagle River             NaN            NaN    WI
18239           Eagle River             RED          LIGHT    WI
18240                  Ybor             NaN           OVAL    FL

[18241 rows x 4 columns]

In [55]:
ufo.iloc[0:3,:] # rows 0 through 2, all columns

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

## 6 Practice exercises

In [2]:
# load the Alcohol consumption by country dataset
url = 'https://raw.githubusercontent.com/um-perez-alvaro/Data-Science-Practice/master/Data/drinks.csv'
drinks = pd.read_csv(url, index_col='country')
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [3]:
# print out data for Albania (using iloc)

In [4]:
# print out data for the USA and Spain (using loc)

In [5]:
# drop the 'continent' column

In [6]:
# drop the row corresponding to Angola

In [7]:
# drop the 10th row

In [9]:
# Print out wine_servings data for France

In [8]:
# Print out total_litres_of_pure_alcohol column three different ways